---
kind: method
id: M:Autodesk.Revit.DB.FilterStringEquals.#ctor
source: html/41c3180e-00ad-89f6-5be5-eff1c4e66047.htm
---
# Autodesk.Revit.DB.FilterStringEquals.#ctor Method

Constructs an instance of FilterStringEquals.

## Syntax (C#)
```csharp
public FilterStringEquals()
```